kimjinhwa/UpsDiagnosysDSP_CPU2/mmc_f2837xd.c

/*-----------------------------------------------------------------------*/
/* MMC/SDC (in SPI mode) control module  (C)ChaN, 2007                   */
/*-----------------------------------------------------------------------*/
/* Only rcvr_spi(), xmit_spi(), disk_timerproc() and some macros         */
/* are platform dependent.                                               */
/*-----------------------------------------------------------------------*/

/*
 * This file was modified from a sample available from the FatFs
 * web site. It was modified to work with a F2837xD device.
 */

//#include "F28x_Project.h"
#include "driverlib.h"
#include "device.h"
#include "mmc_f2837xd.h"
#include "board.h"
#include "F2837xD_device.h"
#include "device.h"
//#include "F2837xD_types.h"
#include "inc/hw_types.h"
#include "fatfs/src/diskio.h"

/*
 * The following header defines the hardware connections used to connect
 * the SDCard.  This can be found under the relevant board directory.
 */
//*****************************************************************************
//
// SDCard SPI port
//
//*****************************************************************************

//*****************************************************************************
//
// GPIO for SDCard SPI pins
//
//*****************************************************************************

//*****************************************************************************
//
// GPIO for the SDCard chip select
//
//*****************************************************************************


/* Definitions for MMC/SDC command */
#define CMD0    (0x40+0)    /* GO_IDLE_STATE */
#define CMD1    (0x40+1)    /* SEND_OP_COND */
#define CMD8    (0x40+8)    /* SEND_IF_COND */
#define CMD9    (0x40+9)    /* SEND_CSD */
#define CMD10    (0x40+10)    /* SEND_CID */
#define CMD12    (0x40+12)    /* STOP_TRANSMISSION */
#define CMD16    (0x40+16)    /* SET_BLOCKLEN */
#define CMD17    (0x40+17)    /* READ_SINGLE_BLOCK */
#define CMD18    (0x40+18)    /* READ_MULTIPLE_BLOCK */
#define CMD23    (0x40+23)    /* SET_BLOCK_COUNT */
#define CMD24    (0x40+24)    /* WRITE_BLOCK */
#define CMD25    (0x40+25)    /* WRITE_MULTIPLE_BLOCK */
#define CMD41    (0x40+41)    /* SEND_OP_COND (ACMD) */
#define CMD55    (0x40+55)    /* APP_CMD */
#define CMD58    (0x40+58)    /* READ_OCR */

// asserts the CS pin to the card
static
void SELECT (void)  //EDITED
{
    //
    // Select the SD card.
    //
    //GpioDataRegs.GPDCLEAR.bit.GPIO125 = 1;
    GPIO_writePin(SPI_CS,0);


}

// De-asserts the CS pin to the card.
static
void DESELECT (void) //EDITED
{
    //GpioDataRegs.GPDSET.bit.GPIO125 = 1;
    GPIO_writePin(SPI_CS,1);
}

/*--------------------------------------------------------------------------

   Module Private Functions

---------------------------------------------------------------------------*/

static volatile
DSTATUS Stat = STA_NOINIT;    /* Disk status */

extern uint16_t cpuTimer1IntCount;
extern uint16_t cpuTimer2IntCount;
#define Timer1 cpuTimer1IntCount
#define Timer2 cpuTimer2IntCount
//static volatile BYTE Timer1, Timer2;    /* 100Hz decrement timer */

static
BYTE CardType;            /* b0:MMC, b1:SDC, b2:Block addressing */

static
BYTE PowerFlag = 0;     /* indicates if "power" is on */

/*-----------------------------------------------------------------------*/
/* Transmit a byte to MMC via SPI  (Platform dependent)                  */
/*-----------------------------------------------------------------------*/

uint8_t CRCTable[256];
void GenerateCRCTable()
{
  int i, j;
  uint8_t CRCPoly = 0x89;  // the value of our CRC-7 polynomial

  // generate a table value for all 256 possible byte values
  for (i = 0; i < 256; ++i) {
    CRCTable[i] = (i & 0x80) ? i ^ CRCPoly : i;
    for (j = 1; j < 8; ++j) {
        CRCTable[i] <<= 1;
        if (CRCTable[i] & 0x80)
            CRCTable[i] ^= CRCPoly;
    }
  }
}

uint8_t CRCAdd(uint8_t CRC, uint8_t message_byte)
{
    return CRCTable[(CRC << 1) ^ message_byte];
}

// returns the CRC-7 for a message of "length" bytes
uint8_t getCRC(uint8_t message[], int length)
{
  int i;
  uint8_t CRC = 0;

  for (i = 0; i < length; ++i)
    CRC = CRCAdd(CRC, message[i]);

  return CRC;
}

static
void xmit_spi (BYTE dat)    //EDITED
{
    volatile DWORD rcvdat;                      //included file like integer.h for DWORD definition

    /* Write the data to the tx fifo */
    while(SpiaRegs.SPISTS.bit.BUFFULL_FLAG);    //Wait for room to write data
    SpiaRegs.SPITXBUF = ((DWORD)dat)<<8;        //Write data

    /* flush data read during the write */
    while(SpiaRegs.SPISTS.bit.INT_FLAG !=1);    //May be possible to switch to '!SpiaRegs.SPISTS.bit.INT_FLAG'
    rcvdat = (SpiaRegs.SPIRXBUF && 0xFF);       //Clear Receive Buffer
}


/*-----------------------------------------------------------------------*/
/* Receive a byte from MMC via SPI  (Platform dependent)                 */
/*-----------------------------------------------------------------------*/

static
BYTE rcvr_spi (void)        //EDITED
{
    volatile DWORD rcvdat;

    //Disable transmission channel
    //SpiaRegs.SPICTL.bit.TALK = 0;

    /* write dummy data */
    while(SpiaRegs.SPISTS.bit.BUFFULL_FLAG);    //Wait for space to write
    SpiaRegs.SPITXBUF = 0xFF00;                 //Write dummy data

    /* read data from RX fifo */
    while(SpiaRegs.SPISTS.bit.INT_FLAG !=1);    //May be possible to switch to '!SpiaRegs.SPISTS.bit.INT_FLAG'
    rcvdat = (SpiaRegs.SPIRXBUF & 0xFF);        //Read Transferred data

    return (BYTE)rcvdat;
}


static
void rcvr_spi_m (BYTE *dst)
{
    *dst = rcvr_spi();
}

/*-----------------------------------------------------------------------*/
/* Wait for card ready                                                   */
/*-----------------------------------------------------------------------*/

static
BYTE wait_ready (void)
{
    BYTE res;


    Timer2 = 50;    /* Wait for ready in timeout of 500ms */
    rcvr_spi();
    do{
        res = rcvr_spi();
        DELAY_US(175);
    } while ((res != 0xFF) && Timer2);

    return res;
}

/*-----------------------------------------------------------------------*/
/* Send 80 or so clock transitions with CS and DI held high. This is     */
/* required after card power up to get it into SPI mode                  */
/*-----------------------------------------------------------------------*/
static
void send_initial_clock_train (void)        //EDITED
{
    volatile DWORD dat;

