kimjinhwa/UpsDiagnosysDSP_CPU2/mmc_f2837xd.c
    /* Ensure CS (STE) is held high. */
    DESELECT();

    /* Switch the SPI TX line to a GPIO and drive it high too. */



    /* Send 10 bytes over the SPI. This causes the clock to wiggle the */
    /* required number of times. */
    unsigned int i;
    for(i = 0 ; i < 10 ; i++)
    {
        /* Write DUMMY data */
        //while(SpiaRegs.SPISTS.bit.BUFFULL_FLAG);
        //SpiaRegs.SPITXBUF = 0xFF00;
        SPI_writeDataNonBlocking(SPIA_BASE,0xFF00);
        SPI_readDataBlockingNonFIFO(SPIA_BASE);
        /* Flush data read during data write. */
        //while(SpiaRegs.SPISTS.bit.INT_FLAG !=1);        //May be possible to switch to '!SpiaRegs.SPISTS.bit.INT_FLAG'
        //dat = (SpiaRegs.SPIRXBUF & 0xFF);
    }

}

/*-----------------------------------------------------------------------*/
/* Power Control  (Platform dependent)                                   */
/*-----------------------------------------------------------------------*/
/* When the target system does not support socket power control, there   */
/* is nothing to do in these functions and chk_power always returns 1.   */

static
void power_on (void)    //EDITED
{
    /*
     * This doesn't really turn the power on, but initializes the
     * SPI port and pins needed to talk to the SD card.
     */
    EALLOW;
    /* Enable the peripherals used to drive the SDC on SPI */
    CpuSysRegs.PCLKCR8.bit.SPI_A = 1;

    /*
     * Configure the appropriate pins to be SPI instead of GPIO. The CS
     * signal is directly driven to ensure that we can hold it low through a
     * complete transaction with the SD card.
     */


    //Unlock the SD-Card SPI GPIOs

    //Set up GPIOs in asynch mode
    EDIS;



    /* Deassert the SPIC chip selects for both the SD card and serial flash */
    DESELECT();

    /* Configure the SPI C port */
    /*
    SpiaRegs.SPICCR.bit.SPISWRESET = 0;         //Set reset bit low
    SpiaRegs.SPICTL.bit.CLK_PHASE = 0;
    SpiaRegs.SPICCR.bit.CLKPOLARITY = 1;
    SpiaRegs.SPICTL.bit.MASTER_SLAVE = 1;       //Master mode
    SpiaRegs.SPIBRR.all = 63;                       //update value to proper setting for correct bitrate ( current: ~500kHz)
    SpiaRegs.SPICCR.bit.SPICHAR = 0x7;          //Set char length to 8 bits
    SpiaRegs.SPICTL.bit.TALK = 1;
    SpiaRegs.SPICCR.bit.SPISWRESET = 1;         //Release SPI from reset
    SpiaRegs.SPIPRI.bit.FREE = 1;
    SpiaRegs.SPIPRI.bit.SOFT = 1;
     */
    /* Set DI and CS high and apply more than 74 pulses to SCLK for the card */
    /* to be able to accept a native command. */
    //send_initial_clock_train();

    DELAY_US(50);

    PowerFlag = 1;
}

// set the SPI speed to the max setting
static
void set_max_speed(void)            //EDIT
{
    // Disable the SPI
    //DevCfgRegs.DC9.bit.SPI_A = 0;
    /*
    SpiaRegs.SPICCR.bit.SPISWRESET = 0;     //Place in reset

    // Configure the SPI C port
    SpiaRegs.SPICTL.bit.CLK_PHASE = 0;
    SpiaRegs.SPICCR.bit.CLKPOLARITY = 1;
    SpiaRegs.SPICTL.bit.MASTER_SLAVE = 1;   //Set Master Mode

    SpiaRegs.SPIBRR.all = 1; // <- (No enforced limit)

    SpiaRegs.SPICCR.bit.SPICHAR = 0x7;      //8 bit char length
    SpiaRegs.SPICTL.bit.TALK = 1;

    // Enable the SPI
    SpiaRegs.SPICCR.bit.SPISWRESET = 1;     //Release from reset
    //DevCfgRegs.DC9.bit.SPI_A = 1;
     */
}

static
void power_off (void)
{
    PowerFlag = 0;
}

static
int chk_power(void)        /* Socket power state: 0=off, 1=on */
{
    return PowerFlag;
}



/*-----------------------------------------------------------------------*/
/* Receive a data packet from MMC                                        */
/*-----------------------------------------------------------------------*/

void delayTimer(unsigned int t)
{

    //Timer1 = t;
    //while (Timer1);
    return;
}
static
BOOL rcvr_datablock (
    BYTE *buff,            /* Data buffer to store received data */
    UINT btr            /* Byte count (must be even number) */
)
{
    BYTE token;


    Timer1 = 10;
    do                              /* Wait for data packet in timeout of 100ms */
    {
        token = rcvr_spi();
    }
    while ((token == 0xFF) && Timer1);
    if(token != 0xFE) return FALSE;    /* If not valid data token, retutn with error */

    do                              /* Receive the data block into buffer */
    {
        rcvr_spi_m(buff++);
        rcvr_spi_m(buff++);
    }
    while (btr -= 2);
    rcvr_spi();                        /* Discard CRC */
    rcvr_spi();

    return TRUE;                    /* Return with success */
}



/*-----------------------------------------------------------------------*/
/* Send a data packet to MMC                                             */
/*-----------------------------------------------------------------------*/

#if _READONLY == 0
static
BOOL xmit_datablock (
    const BYTE *buff,    /* 512 byte data block to be transmitted */
    BYTE token            /* Data/Stop token */
)
{
    BYTE resp, wc;


    if (wait_ready() != 0xFF) return FALSE;

    xmit_spi(token);                    /* Xmit data token */
    if (token != 0xFD)      /* Is data token */
    {
        wc = 256;
        do                              /* Xmit the 512 byte data block to MMC */
        {
            xmit_spi(*buff++);
            xmit_spi(*buff++);
        }
        while (--wc);
        xmit_spi(0xFF);                    /* CRC (Dummy) */
        xmit_spi(0xFF);
        resp = rcvr_spi();                /* Reveive data response */
        if ((resp & 0x1F) != 0x05)        /* If not accepted, return with error */
            return FALSE;
    }

    return TRUE;
}
#endif /* _READONLY */



/*-----------------------------------------------------------------------*/
/* Send a command packet to MMC                                          */
/*-----------------------------------------------------------------------*/

static
BYTE send_cmd (
    BYTE cmd,        /* Command byte */
    DWORD arg        /* Argument */
)
{
    BYTE n=0, res=0;
    BYTE sb[5];
    sb[1]=0x00ff & (BYTE)(arg >> 24);
    sb[2]=0x00ff & (BYTE)(arg >> 16);
    sb[3]=0x00ff & (BYTE)(arg >>  8);
    sb[4]=0x00ff & (BYTE)(arg );
    sb[0]=cmd;

    if (wait_ready() != 0xFF) return 0xFF;

    /* Send command packet */
    xmit_spi(0x00ff & cmd);                        /* Command */
    xmit_spi(0x00ff & (BYTE)(arg >> 24));        /* Argument[31..24] */
    xmit_spi(0x00ff & (BYTE)(arg >> 16));        /* Argument[23..16] */
    xmit_spi(0x00ff & (BYTE)(arg >> 8));            /* Argument[15..8] */
    xmit_spi(0x00ff & (BYTE)arg);                /* Argument[7..0] */
    n = 0;
    if (cmd == CMD0) n = 0x95;            /* CRC for CMD0(0) */
    else if (cmd == CMD8) n = 0x87;            /* CRC for CMD8(0x1AA) */
    else if (cmd == CMD41) n = 0x77;            /* CRC for CMD41  inserted by jhkim*/
    else if (cmd == CMD55) n = 0x65;            /* CRC for CMD41  inserted by jhkim*/
    else
        n = getCRC((uint8_t *)sb,5)<<1 | 1;
    xmit_spi(n);

    /* Receive command response */
    if (cmd == CMD12) rcvr_spi();        /* Skip a stuff byte when stop reading */
    n = 10;                                /* Wait for a valid response in timeout of 10 attempts */
    do
        res = rcvr_spi();
    while ((res & 0x80) && --n);

    return res;            /* Return with the response value */
}

/*-----------------------------------------------------------------------*
 * Send the special command used to terminate a multi-sector read.
 *
 * This is the only command which can be sent while the SDCard is sending
 * data. The SDCard spec indicates that the data transfer will stop 2 bytes
 * after the 6 byte CMD12 command is sent and that the card will then send
 * 0xFF for between 2 and 6 more bytes before the R1 response byte.  This
 * response will be followed by another 0xFF byte.  In testing, however, it
 * seems that some cards don't send the 2 to 6 0xFF bytes between the end of
 * data transmission and the response code.  This function, therefore, merely
 * reads 10 bytes and, if the last one read is 0xFF, returns the value of the
 * latest non-0xFF byte as the response code.
 *
 *-----------------------------------------------------------------------*/

static
BYTE send_cmd12 (void)
{
    BYTE n, res, val;

    /* For CMD12, we don't wait for the card to be idle before we send
     * the new command.
     */

    /* Send command packet - the argument for CMD12 is ignored. */
    xmit_spi(CMD12);
    xmit_spi(0);
    xmit_spi(0);
    xmit_spi(0);
    xmit_spi(0);
    xmit_spi(0);

    /* Read up to 10 bytes from the card, remembering the value read if it's
       not 0xFF */
    for(n = 0; n < 10; n++)
    {
        val = rcvr_spi();
        if(val != 0xFF)
        {
            res = val;
        }
    }

    return res;            /* Return with the response value */
}

/*--------------------------------------------------------------------------

   Public Functions

---------------------------------------------------------------------------*/


/*-----------------------------------------------------------------------*/
/* Initialize Disk Drive                                                 */
/*-----------------------------------------------------------------------*/
DSTATUS disk_initialize (
    BYTE drv        /* Physical drive nmuber (0) */
)
{
    BYTE n, ty, ocr[4];

    GenerateCRCTable();
    ocr[0]= ocr[1]= ocr[2]= ocr[3]=0x00;
    if (drv) return STA_NOINIT;            /* Supports only single drive */
    if (Stat & STA_NODISK) return Stat;    /* No card in the socket */


    power_on();                            /* Force socket power on */
    send_initial_clock_train();
    SELECT();                /* CS = L */

